"use strict";

/* 
Задача 1: Найти сумму квадратов чисел
Создайте массив чисел. Используя forEach(), найдите сумму квадратов каждого числа и выведите результат. 
*/

/* 
Задача 2: Фильтрация положительных чисел
Создайте массив чисел. Используя forEach(), создайте новый массив, содержащий только положительные числа. 
*/

/* 
Задача 3: Подсчет гласных букв
Создайте массив строк. Используя forEach(), подсчитайте количество гласных букв в каждой строке и выведите результат.
 */

/* 
Эту же задачу можно решить с помощью регулярных выражений
*/

// Пример использования

/* 
Задача 4: Преобразование текста
Создайте массив строк с разными словами. Используя forEach(), создайте новый массив, содержащий каждое слово, преобразованное в верхний регистр.
*/

/* 
Задача 5: Фильтрация слов по длине
Создайте массив строк. Используя forEach(), создайте новый массив, содержащий только те слова, длина которых больше определенного значения (например, 5).
*/

/*
Задача 6: Обновление свойств объектов
Создайте массив объектов с разными свойствами. Используя forEach(), обновите значение одного из свойств в каждом объекте.
*/

/*
Задача 7: Объединение массивов
Создайте два массива. Используя forEach(), объедините их в новый массив, содержащий все элементы обоих массивов.
*/

/*
Задача 8: Удаление элементов из массива
Создайте массив чисел. Используя forEach(), удалите из массива все элементы, которые меньше определенного значения.
*/

/*
Задача 9: Генерация HTML списка
Создайте массив объектов, представляющих элементы списка (например, задачи). Используя forEach(), создайте HTML-строку, представляющую список этих элементов.
*/

/*
Задача 10: Обработка ошибок
Создайте массив чисел и строк. Используя forEach(), попробуйте преобразовать каждый элемент в число. Обработайте возможные ошибки и выведите результат.
*/
