/*
Создание объекта:
Создайте объект person с полями name, age и city. Присвойте им значения, представляющие человека.

Доступ к свойствам:
Выведите в консоль имя и возраст из объекта person.

Изменение свойств:
Измените возраст в объекте person на новое значение.
Выведите в консоль обновленный объект person.

Добавление свойства:
Добавьте к объекту person новое поле gender со значением "male" или "female".
Выведите в консоль обновленный объект person.

Удаление свойства:
Удалите поле city из объекта person.
Выведите в консоль обновленный объект person.

Цикл по свойствам:
Используя цикл for...in, выведите все свойства объекта person и их значения в консоль.

Объект в массив:
Создайте массив, содержащий все значения из объекта person. Например, [nameValue, ageValue, genderValue].
Выведите массив в консоль.

Копирование объекта:
Создайте новый объект anotherPerson и скопируйте в него все свойства из объекта person.
Измените значение какого-то свойства в anotherPerson.
Выведите оба объекта в консоль для проверки. 
 */
